In [2]:
import pandas as pd

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
d = pd.Series([4,8,15,16,23,42])
d

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [7]:
d1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
d1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data:

In [10]:
df = pd.DataFrame({ 'Name' : ["Alice" , "Bob" ,"Claire"],
                    'Age' : [25 , 30 , 27],
                    'Gender' : [ "Female" , "Male" ,"Female"]})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

####  What is ‘DataFrame’ in pandas?
#### DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object.

#### What is ‘series’ in pandas?
#### A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

In [13]:
# ‘DataFrame’ example
df = pd.DataFrame({ 'Name' : ["Alice" , "Bob" ,"Claire"],
                    'Age' : [25 , 30 , 27],
                    'Gender' : [ "Female" , "Male" ,"Female"]})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
# "Series" example
d1 = pd.Series([1,2,3,4,5,6,7,8,9,10])
d1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [ ]:
'''read_csv()`: Load data from a CSV file.
   fillna()`: Replace missing values in a DataFrame.
   mean()`: Calculate the mean of a Series or DataFrame.
   std()`: Calculate the standard deviation of a Series or DataFrame.'''

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
# size mutable.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [15]:

author = ['Jitender', 'Purnima',
          'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
 
auth_series = pd.Series(author)
article_series = pd.Series(article)
 
frame = {'Author': auth_series,
         'Article': article_series}
 
result = pd.DataFrame(frame)
 
print(result)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178